In [1]:
import pandas as pd
import numpy as np

## concatenation

In [8]:
sozluk1={"isim":["Ahmet","mehmet","atıl","zeynep"],
        "Spor":["tenis","koşu","yüzme","basketbol"],
        "Kalori":[100,200,300,400]}
sportDataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [9]:
sportDataFrame1

     isim       Spor  Kalori
0   Ahmet      tenis     100
1  mehmet       koşu     200
2    atıl      yüzme     300
3  zeynep  basketbol     400

In [10]:
sozluk2={"isim":["veli","doğukan","osman","ömer"],
        "Spor":["tenis","koşu","yüzme","basketbol"],
        "Kalori":[100,200,300,400]}
sportDataFrame2=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [11]:
sozluk3={"isim":["emir","murat","nur","batuhan"],
        "Spor":["tenis","koşu","yüzme","basketbol"],
        "Kalori":[100,200,300,400]}
sportDataFrame3=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [13]:
sportDataFrame1

     isim       Spor  Kalori
0   Ahmet      tenis     100
1  mehmet       koşu     200
2    atıl      yüzme     300
3  zeynep  basketbol     400

In [14]:
sportDataFrame2

     isim       Spor  Kalori
0   Ahmet      tenis     100
1  mehmet       koşu     200
2    atıl      yüzme     300
3  zeynep  basketbol     400

In [15]:
sportDataFrame3

     isim       Spor  Kalori
0   Ahmet      tenis     100
1  mehmet       koşu     200
2    atıl      yüzme     300
3  zeynep  basketbol     400

In [16]:
pd.concat([sportDataFrame1,sportDataFrame2,sportDataFrame3])

     isim       Spor  Kalori
0   Ahmet      tenis     100
1  mehmet       koşu     200
2    atıl      yüzme     300
3  zeynep  basketbol     400
0   Ahmet      tenis     100
1  mehmet       koşu     200
2    atıl      yüzme     300
3  zeynep  basketbol     400
0   Ahmet      tenis     100
1  mehmet       koşu     200
2    atıl      yüzme     300
3  zeynep  basketbol     400

## merging / merge